[
    [
        "Automated loop development of aura-cli using the aura loop system and brain",
        6.95
    ],
    [
        "loop and workflow integration into main.py",
        6.05
    ],
    [
        "doctor",
        7.05
    ],
    [
        "automated goal handling and updating for autonomous development --decompose",
        7.35
    ],
    [
        "automated goal handling and updating for autonomous development",
        7.2
    ],
    [
        "Add rollback/transaction support to ApplicatorAgent so multiple file changes in a cycle succeed or fail atomically, preventing half-applied mutations that leave the codebase in an inconsistent state.",
        7.05
    ],
    [
        "When SandboxAgent execution fails, have CoderAgent automatically re-generate code with sandbox stderr as feedback context, retrying up to 3 times before escalating to verification failure.",
        8.049999999999999
    ],
    [
        "Use VectorStore semantic search to intelligently compress Brain memory dumps that exceed the model token budget, retaining the most-relevant entries to prevent token overflow errors in the planning phase.",
        7.05
    ],
    [
        "Extend architecture_validator skill to build a directed import graph from the project and detect circular imports using strongly connected components, flagging them with file paths and remediation suggestions.",
        0.0
    ],
    [
        "Modify test_coverage_analyzer skill to run coverage.py only on files changed since last git commit (via git diff HEAD) plus their corresponding test files, instead of scanning the full suite each cycle.",
        7.65
    ],
    [
        "Add LLM-based goal type classification to GoalDecomposer that tags each incoming goal as bug_fix, feature, refactor, security, docs, or unknown, persisting the tag to goal_queue_v2.json to guide skill dispatch.",
        7.45
    ],
    [
        "When ApplicatorAgent raises OldCodeNotFoundError, automatically query git log to find the nearest matching version of the target code via fuzzy matching and retry the apply with the corrected old_code.",
        5.8
    ],
    [
        "Create end-to-end integration tests in tests/integration/ that mock all external model calls, run a 2-cycle LoopOrchestrator loop on a synthetic mini-project, and assert that cycle outputs are persisted correctly to MemoryStore.",
        8.65
    ],
    [
        "When VerifierAgent detects a security_scanner critical finding or test coverage drops by more than 20%, automatically pause the loop and queue a needs_human_review goal instead of continuing autonomous cycles.",
        8.049999999999999
    ],
    [
        "Extend skill_dispatcher to detect when one skill's output contains data that is valid input for a downstream skill (e.g., security_scanner findings feeding remediation goals) and chain them automatically within the same cycle.",
        5.949999999999999
    ],
    [
        "Implement cache preloading in ModelAdapter: on startup load the top-50 most-recently-used prompt hashes from brain_v2.db response_cache into LocalCacheAdapter to eliminate cold-start latency on the first loop cycle.",
        7.8
    ],
    [
        "Create a new skill agents/skills/skill_failure_analyzer.py that parses skill exception logs clustered by error type and generates actionable repair goals (e.g., update symbol_indexer to handle async/await patterns).",
        7.8
    ],
    [
        "Enhance ConvergenceEscapeLoop to detect verification-phase oscillation (tests alternately pass/fail across cycles) and trigger escalation strategies: increase prompt verbosity, run linter auto-fix, or request human context.",
        7.05
    ],
    [
        "Track goal complexity metrics (cyclomatic complexity, lines of code affected, number of files changed) at cycle start and use them to adaptively adjust skill dispatch depth and prompt context window size, logging decisions to goal_queue_v2.json.",
        7.55
    ],
    [
        "Refactor ASCM implementation to support incremental indexing via content hash checks in ProjectKnowledgeSyncer",
        7.55
    ],
    [
        "Perform an autonomous audit of the core/ directory, identify the most complex module using the complexity_scorer skill, and implement one high-impact performance optimization or structural refactor to improve maintainability",
        8.2
    ],
    [
        "Continue CLI hardening roadmap: choose next maintainability improvement, implement with tests/docs, preserve legacy compatibility",
        8.2
    ],
    [
        "Validate queue max-cycle plumbing after fix",
        8.049999999999999
    ],
    [
        "Validate grounded retry after invalid IMPLEMENT path",
        7.05
    ],
    [
        "Validate candidate-file grounding hint after invalid path",
        7.8
    ],
    [
        "Validate fuzzy fallback candidate-file grounding hint",
        7.05
    ],
    [
        "Improve invalid-path grounding candidate suggestions by biasing toward aura_cli/core/tests for CLI-related goals, with tests",
        7.8
    ],
    [
        "Perform a careful code review of recent core/task_handler.py grounding-retry and candidate-file suggestion changes; identify bugs/regressions and implement safe fixes with tests",
        7.05
    ],
    [
        "Perform a careful code review of recent core/task_handler.py grounding-retry and candidate-file suggestion changes; identify bugs/regressions and implement safe fixes with tests",
        7.95
    ],
    [
        "Re-review core/task_handler.py grounding-retry and candidate-file suggestion logic after manual fixes; verify no regressions and suggest only targeted improvements",
        7.05
    ],
    [
        "Re-review core/task_handler.py grounding-retry and candidate-file suggestion logic after manual fixes; verify no regressions and suggest only targeted improvements",
        8.049999999999999
    ],
    [
        "Verify queue-loop resilient apply path after _safe_apply_change integration in core/task_handler.py; review and apply only safe targeted fixes with tests",
        8.049999999999999
    ],
    [
        "Validate queue overwrite safety policy in core/task_handler.py: stale-snippet mismatch should be blocked with grounded retry, and only explicit full-file form (overwrite_file=true with empty old_code) should be allowed",
        8.049999999999999
    ]
]